{
  "test_doc_1_chunk_0": {
    "document_id": "test_doc_1",
    "chunk_index": 0,
    "content": "Construction safety requires proper training and certification. Workers must wear appropriate PPE and follow established procedures.",
    "metadata": {
      "title": "Test Document",
      "course_id": 1
    },
    "created_at": "2025-09-11T10:02:09.015901"
  },
  "doc_2_chunk_0": {
    "document_id": "doc_2",
    "chunk_index": 0,
    "content": "Learner Workbook FTD v4 June25 Page 1 of 50 Learner Workbook FTD v4 June25 Page 2 of 50 SKILLS BOOTCAMP IN PLANT OPERATIONS Learner Workbook: Forward Tipping Dumper Learner Workbook FTD v4 June25 Page 3 of 50 OUR COMMITMENT TO IMPLEMENTING AN INDUSTR Y LEADING OPERA TED PLANT MODEL We hope that you enjoy your training with us and that you get the maximum benefit possible out of the course that you have registered for. Learner success is at the core of our delivery strategy. Our commitment to high quality training delivery supports the industry-wide need to develop the future generation of plant operators. In addition to being approved by the Department for Education (DfE) to deliver the skills bootcamp programme, we are an accredited training provider, registered with the two main plant operator card schemes in the construction plant training sector, namely CPCS and NPORS. All trainers and testers are highly experienced in their field and are registered with either of the two accreditation schemes, some are registered with both. WHA T CAN YOU EXPECT DURING YOUR TRAINING? You can expect the highest level of training and testing, delivered by experienced, and highly competent trainers and testers. We ensure that our people maintain their high standards through robust internal and external quality assurance measures. We provide an inclusive approach to our training delivery model to ensure our courses are accessible where possible. For more information about the Skills Bootcamp in Plant Operations, visit our website: www.flanneryplant.com/plant-operator-training Learner Workbook FTD v4 June25 Page 4 of 50 CONTENTS WHAT CAN YOU EXPECT DURING YOUR TRAINING? 2 HOW TO USE THIS GUIDE 4 ALWAYS REMEMBER TO OperateSAFE 4 LITERACY – NUMERACY – ICT 4 INTRODUCTION TO THE FORWARD TIPPING DUMPER 5 SAFE WORKING PRACTICES - THE ROLE OF THE FORWARD TIPPING DUMPER OPERATOR 6 HEALTH AND SAFETY AT WORK ACT 1974 8 PROVISION & USE OF WORK EQUIPMENT REGULATIONS 1998 (PUWER 98 ) 10 ADDITIONAL LEGISLATION AND GUIDANCE: 11 RISK ASSESSMENTS AND METHOD STATEMENTS 11 SOCIAL RESPONSIBILITIES 12 SITE INDUCTION 13 OPERATOR ROLES & RESPONSIBILITIES 13 MAJOR COMPONENTS OF A FORWARD TIPPING DUMPER 15 DIFFERENT TYPES OF DUMPER & SKIPS 16 PRINCIPAL COMPONENTS OF THE MACHINE 17 PRE-OPERATIONAL CHECKS - MANUFACTURERS AND LEGISLATIVE REQUIREMENTS 20 PERSONAL PROTECTIVE EQUIPMENT (PPE) 20 Learner Workbook FTD v4 June25 Page 5 of 50 SAFELY GET ON AND OFF THE FORWARD TIPPING DUMPER 21 PREPARE AND CONFIGURE THE FORWARD TIPPING DUMPER FOR SITE TRAVEL 21 VISIBILITY AIDS 24 PEDESTRIANISED AREAS 25 TRAVELLING ON A PUBLIC HIGHWAY 25 TOWING EQUIPMENT WITH A DUMPER – ENHANCED TRAINING 26 TRAVEL AND MANOEUVRE THE DUMPER 27 TRAVEL AND MANOEUVRE IN AREAS OF RESTRICTED SPACE 31 OPERATING IN CONFINED AREAS 31 CONDUCT ALL NECESSARY SAFETY CHECKS AT THE LOADING AND DISCHARGING AREA 35 ENSURE LOAD INTEGRITY/ SECURITY 36 LOADING, TRANSPORTING AND DISCHARGING DIFFERENT MATERIALS 36 DISCHARGING LOADS 37 ENVIRONMENTAL CONSIDERATIONS OF MACHINE USE 40 LOADING/ UNLOADING PROCEDURES FOR MACHINE TRANSPORTATION 41 GLOSSARY OF TERMS 46 HOW TO USE THIS GUIDE This guide",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.807019"
  },
  "doc_2_chunk_1": {
    "document_id": "doc_2",
    "chunk_index": 1,
    "content": "ALL NECESSARY SAFETY CHECKS AT THE LOADING AND DISCHARGING AREA 35 ENSURE LOAD INTEGRITY/ SECURITY 36 LOADING, TRANSPORTING AND DISCHARGING DIFFERENT MATERIALS 36 DISCHARGING LOADS 37 ENVIRONMENTAL CONSIDERATIONS OF MACHINE USE 40 LOADING/ UNLOADING PROCEDURES FOR MACHINE TRANSPORTATION 41 GLOSSARY OF TERMS 46 HOW TO USE THIS GUIDE This guide has been produced to help you through the course and helps to reinforce the learning that you will receive throughout the course. Throughout the workbook you will come across QR codes which you can scan using your android or IOS smartphone. These will lead you to additional content including videos and additional reading materials. You will also find some Notepads and OperateSafe stops with some helpful reminders. To your right is a notepad with some ways to gain maximum benefit from your training. Throughout the workbook, you will find KNOWLEDGE STOP’s . This is your chance to put your learning to the test. Learner Workbook FTD v4 June25 Page 6 of 50 ALWAYS REMEMBER TO OperateSAFE Throughout the workbook, you will come across OperateSAFE safety reminders. OperateSAFE is an example of a company wide Health & Safety campaign which is championed by Flannery Plant Hire. It is a campaign aimed at driving health and safety awareness and engagement across the business and industry wide. Other companies will champion their own internal and external health and safety campaigns which we encourage you to familiarize yourself with when starting at a new job. The OperateSAFE safety reminders throughout the workbook aim to highlight key safety messages to our learners. Scan the QR code here to view the OperateSafe introduction video. LITERACY – NUMERACY – ICT English, Mathematics and ICT are embedded into the content. You will be required to extract information from the operator manual, conduct simple calculations of bucket capacities and read digital screens in the cab of the machine or using one of our training simulators. INTRODUCTION TO THE FOR WARD TIPPING DUMPER A Forward Tipping Dumper (FTD) is commonly used on construction sites. It is used to transport large quantities of materials across a site, usually on rough, undulating terrain. Its ability to handle a mixture of terrain and carry large loads makes it a flexible piece of equipment. This course will equip you with the knowledge, skills and confidence to operate the machine safely, protecting both you and those around you. This course offers two certificate options: operating either a tracked or wheeled machine depending on your needs. The course objectives are as follows: \u0000 Understand the relevant legislation relating to work activities. \u0000 Comply with the manufacturer's instructions, using the operator's handbook and other information sources. \u0000 Identify the hazards associated with plant or machinery operations and put the appropriate control measures in place. \u0000 Identify the machine components and operator controls. \u0000 Perform pre-shift and operational checks. \u0000 Prepare the forward tipping dumper for site and road travel. Learner Workbook FTD v4 June25 Page 7 of 50 \u0000 Drive over various types of terrain. \u0000 Manoeuvre",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.807361"
  },
  "doc_2_chunk_2": {
    "document_id": "doc_2",
    "chunk_index": 2,
    "content": "put the appropriate control measures in place. \u0000 Identify the machine components and operator controls. \u0000 Perform pre-shift and operational checks. \u0000 Prepare the forward tipping dumper for site and road travel. Learner Workbook FTD v4 June25 Page 7 of 50 \u0000 Drive over various types of terrain. \u0000 Manoeuvre in confined areas. \u0000 Complete a range of loading procedures. \u0000 Discharge loads into trenches or over edges \u0000 Explain the procedures for loading and unloading on and off a transporter. \u0000 Shut down machinery safely and secure it at the end of the operation. N.B. All content delivered on this course meets the requirements set out in the National Occupational Standards for this machine type CONSTRUCTION SITE OPERA TIONS Construction sites are busy places and present many dangers. During this course you will be taught how to act responsibly on site, how to identify common hazards and how to operate your machine safely and efficiently on site to reduce to as low as possible the risks to you and others. Learner Workbook FTD v4 June25 Page 8 of 50 SAFE WORKING PRACTICES RELEV ANT TO THE ROLE OF THE FOR WARD TIPPING DUMPER OPERA TOR Preparing for work Conduct all pre – operational checks in accordance with manufacturers and legislative requirements. Travelling and maneuvering Travel and maneuver the forward tipping dumper safely across varying terrain and inclines. Setting up for work Conduct all necessary safety checks at the loading and discharging areas. Working tasks ● Receive loads from other machines safely. ● Ensure load integrity and security. ● Tip safely into excavations or over edges. ● Completing work ● The environmental considerations of machine use ● Loading/ unloading procedures for machine transportation. Shutting Down Carry out all end of work and shut down procedures. Learner Workbook FTD v4 June25 Page 9 of 50 HEAL TH AND SAFETY AT WORK ACT 1974 The Health and Safety at Work Act 1974 is designed to protect people and the environment from workplace activities. It places certain duties and responsibilities on employers, employees, self-employed, designers and manufactures. Learner Workbook FTD v4 June25 Page 10 of 50 Learner Workbook FTD v4 June25 Page 11 of 50 PROVISION & USE OF WORK EQUIPMENT REGULA TIONS 1998 (PUWER 98 ) Work equipment is any machinery, appliance, apparatus, tool or installation for use at work (whether exclusively or not). This includes equipment which employees provide for their own use at work. The scope of work equipment is therefore extremely wide. Learner Workbook FTD v4 June25 Page 12 of 50 Machines must be stable when in use; machines have been known to fall over. ROPS (Roll Over Protective Structures) & FOPS (Falling Object Protective Structures) must be in place to provide some protection to the operator in the event of the machine overturning or from small falling objects. Equipment must be capable of being maintained safely. Accidents occur during maintenance thus the risks encountered during such maintenance must be reduced. ADDITIONAL LEGISLA TION AND GUIDANCE: Management of Health",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.807621"
  },
  "doc_2_chunk_3": {
    "document_id": "doc_2",
    "chunk_index": 3,
    "content": "place to provide some protection to the operator in the event of the machine overturning or from small falling objects. Equipment must be capable of being maintained safely. Accidents occur during maintenance thus the risks encountered during such maintenance must be reduced. ADDITIONAL LEGISLA TION AND GUIDANCE: Management of Health and Safety at Work Regulations (MHSWR) Construction (Design and Management) Regulations (CDM) Vibration at Work Regulations Road Traffic Act HSG 114 – The safe use of vehicles on construction sites HSG 46 – Guide for small contractors Plant Safety Group – Safe use of dumpers Control of Substances Hazardous to Health Regulations The Control of Noise Regulations RISK ASSESSMENTS AND METHOD STATEMENTS Employers are required by law to protect your employees, and others, from harm. Under the Management of Health and Safety at Work Regulations 1999, the minimum you must do is: ● Identify what could cause injury or illness in your business (hazards) ● Decide how likely it is that someone could be harmed and how seriously (the risk) Take action to eliminate the hazard, or if this isn't possible, control the risk. The purpose of a Method Statement when on site is to document given specific instructions on how to SAFELY perform a work-related task. It is the plant operator’s responsibility to COMPLY with the Method Statement. Learner Workbook FTD v4 June25 Page 13 of 50 SOCIAL RESPONSIBILITIES In general plant operators are regarded as ‘safety-critical’ workers, which means their actions with the machine can have significant health & safety consequences for themselves and others. It is essential that all personnel involved in the planning, supervision and carrying out of mobile plant operations are adequately trained and competent for their role. SITE INDUCTION Learner Workbook FTD v4 June25 Page 14 of 50 ● Access and egress ● Safety signs and signals When starting work on a new site you will undergo a site induction. Familiarise yourself with some of the subject areas that will be included in a site induction. OPERA TOR ROLES & RESPONSIBILITIES As a ‘safety critical’ worker, plant operators are required to: ✔ Only use site plant or equipment if you are trained, competent and have been authorised to do so. ✔ Only authorised operators should hold vehicle keys. ✔ You are required to work safely, efficiently and comply with the method statement. ✔ Be punctual and co-operate with other workers – this can contribute towards repeat business with the client or principal contractor. Operators should also be trained in the safe operation of the specific machine that they are required to operate, which will include: ● Layout and operation of the controls. ● Stability limits. ● Daily checks and how to do them safely. Learner Workbook FTD v4 June25 Page 15 of 50 ● Accident reporting ● Confined spaces ● Emergency procedures ● Buried services ● Reporting structure ● Contamination ● PPE/RPE requirements ● Electricity ● Welfare facilities ● Lifting operations ● Reporting procedures ● Working from/at height ● Site Layout ● Waste disposal",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.807869"
  },
  "doc_2_chunk_4": {
    "document_id": "doc_2",
    "chunk_index": 4,
    "content": "Learner Workbook FTD v4 June25 Page 15 of 50 ● Accident reporting ● Confined spaces ● Emergency procedures ● Buried services ● Reporting structure ● Contamination ● PPE/RPE requirements ● Electricity ● Welfare facilities ● Lifting operations ● Reporting procedures ● Working from/at height ● Site Layout ● Waste disposal ● Traffic Routes ● Smoking policy ● Restricted/prohibited areas Always use the operator’s manual for the machine you are operating. This includes safety information, maintenance and information on operation. Good timekeeping, being polite, being safe and doing a good job are all ways of ensuring repeat business with a client or principle contractor. Additional Sources of Information ● Codes of Practice ● Site plans / drawings ● Risk assessments and method statements ● COSHH Regulations ● Safety data sheets ● Load / tare sheets ● Inspection and reporting forms / procedures Forward Tipping Dumper Learner Workbook FTD v4 June25 Page 16 of 50 MAJOR COMPONENTS OF A FOR WARD TIPPING DUMPER Learner Workbook FTD v4 June25 Page 17 of 50 DIFFERENT TYPES OF DUMPER & SKIPS PRINCIP AL COMPONENTS OF THE MACHINE Learner Workbook FTD v4 June25 Page 18 of 50 Power Unit – Oils Always wear gloves when checking engine oil to prevent skin disease and contamination of oil onto the operating controls and the cab. Hydraulic System Always ensure the filler cap area is clean and pressure in the system is released before removing the cap. Always use a clean container when filling the system to prevent contamination. Fuel System Where possible, plant should be filled up at the end of your shift to prevent condensation building up in the tank. Cooling System Cooling systems are normally pressurised and removing the cap can allow hot water to escape with the potential for causing SEVERE burns. Roll Over Protective Structure ROPS provides some protection to the operating position (as far as is reasonably practicable) in the event of an overturn. Falling Object Protective Structures Where there is the risk of people operating mobile work equipment being struck by falling material, falling object protective structures (FOPS) or a manufacturer’s strengthened cab must be fitted to stop any falling material Learner Workbook FTD v4 June25 Page 19 of 50 striking the operator. When sitting in an enclosed cab that meets FOPS criteria, a hard hat does not need to be worn. Restraining Systems Seat belts must be worn even when the cab door is closed. This is because in the event of a roll over (as far as reasonably practical), it will keep the operator within the confines of the operating seat which may minimise injury. Tyres Raised lugs on tyres provide traction / grip for moving, steering and braking in soft mud. If tyres are worn, traction and grip will be severely affected. Learner Workbook FTD v4 June25 Page 20 of 50 Learner Workbook FTD v4 June25 Page 21 of 50 PRE-OPERA TIONAL CHECKS IN ACCORDANCE WITH MANUF ACTURERS AND LEGISLA TIVE REQUIREMENTS The Health and Safety at Work Act",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.808158"
  },
  "doc_2_chunk_5": {
    "document_id": "doc_2",
    "chunk_index": 5,
    "content": "soft mud. If tyres are worn, traction and grip will be severely affected. Learner Workbook FTD v4 June25 Page 20 of 50 Learner Workbook FTD v4 June25 Page 21 of 50 PRE-OPERA TIONAL CHECKS IN ACCORDANCE WITH MANUF ACTURERS AND LEGISLA TIVE REQUIREMENTS The Health and Safety at Work Act 1974 states that employees must take reasonable care of themselves and others who may be affected by their actions. It is a requirement to check that the machine is safe to use prior to using it. The following items must be checked prior to use: PERSONAL PROTECTIVE EQUIPMENT (PPE) Always ensure that you wear the full PPE required for the site that you are working on. ✔ Head protection ✔ Foot protection ✔ High-visibility clothing ✔ Weather-appropriate clothing ✔ Hearing protection ✔ Eye protection ✔ Gloves Learner Workbook FTD v4 June25 Page 22 of 50 SAFEL Y GET ON AND OFF THE FOR WARD TIPPING DUMPER ✔ Face the machine using the specific steps and handrails provided. ✔ Maintain 3 points of contact wherever possible. ✔ Ensure the steps and handrails are clean and clear of debris in your daily checks. ✔ Ensure the ground you are stepping out onto or walking on is firm and clear of obstructions before existing the cab. Wearing the correct boots can eliminate injuries. Ensure they are laced up fully and worn correctly. PREP ARE AND CONFIGURE THE FOR WARD TIPPING DUMPER FOR SITE TRAVEL ✔ Engine cover – secured. ✔ Check parking brake – on. ✔ Check controls are neutralised. ✔ Adjust seat for comfort / reach. Learner Workbook FTD v4 June25 Page 23 of 50 ✔ Adjust steering column as appropriate. ✔ Wear seatbelt – adjust as required. ✔ Foot brake – pressure. Learner Workbook FTD v4 June25 Page 24 of 50 Learner Workbook FTD v4 June25 Page 25 of 50 VISIBILITY AIDS Always ensure that all mirrors / cameras are correctly fitted, unbroken, clean, and correctly adjusted. Check that ALL mirrors are clean and correctly positioned to provide you with a clear, unobstructed view behind the dumper. Learner Workbook FTD v4 June25 Page 26 of 50 PEDESTRIANISED AREAS If you are setting up to work in pedestrianised areas, always take the following into consideration. ● Always ensure physical segregation of pedestrians from machines and the work ● Machine movements ● Noise ● Fumes TRAVELLING ON A PUBLIC HIGHW AY When travelling on the public highway, the machine must adhere to the following requirements by law: ✔ The dumper must be registered and taxed as a “special vehicle” ✔ The dumper must have vehicle insurance ✔ If the dumper can exceed 20 mph it must have a horn in good working condition ✔ If it can exceed 25 mph it must have a speedometer in good working condition ✔ It must have brakes that enable it to stop ✔ It must have lights and indicators The operator must: ✔ Hold a full UK or approved car license (Category B) Learner Workbook FTD",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.808448"
  },
  "doc_2_chunk_6": {
    "document_id": "doc_2",
    "chunk_index": 6,
    "content": "✔ If it can exceed 25 mph it must have a speedometer in good working condition ✔ It must have brakes that enable it to stop ✔ It must have lights and indicators The operator must: ✔ Hold a full UK or approved car license (Category B) Learner Workbook FTD v4 June25 Page 27 of 50 ✔ Be a minimum of 18 years old for vehicles beween 3.5T and 7.5T ✔ Be a minimum of 21 years old for vehicles exceeding 7.5T (MAM) TOWING EQUIPMENT WITH A DUMPER – ENHANCED TRAINING Some dumpers have the capability to tow equipment such as small bowsers and compressors. As dumpers are not specifically designed for towing purposes, other methods should be explored before deciding on this purpose. Towing with a dumper requires enhanced training, in addition to the training delivered within the Skills Bootcamp programme. To assist with your knowledge and understanding of this ‘safety critical’ activity, below outlines some key safety information when towing with a dumper. Should you be asked to tow equipment, you must consider the following points: ✔ All options have been considered and there no other more suitable machine is available. ✔ Towing activities are authorised by the manufacturer of the dumper to be used. ✔ The equipment to be towed does not exceed the specification set by the manufacturer in terms of the weight of the equipment and the downward load imposed on the towing point. ✔ The towing bracket is compatible with the towing eye on the equipment to be towed. ✔ You have been trained and are competent to carry out towing activities. ✔ The correct towing pin for the towing bracket is used and that the safety pin is located correctly in the towing pin. ✔ Towing balls come in a variety of sizes and where the size of ball differs from the towed equipment’s towing hitch, there is a danger that the hitch can dislodge from the ball and the towed equipment become detached from the dumper. ✔ The manufacturers handbook should be consulted to ensure a full understanding of the towing restrictions placed by the manufacturer. It should be noted that manufacturers requirements differ between different models from the same manufacturer. ✔ The towing ability of the dumper may depend on whether the trailer is fitted with an overrun brake or is non-braked. Using an overweight non-braked trailer could cause loss of control during the braking activity. Learner Workbook FTD v4 June25 Page 28 of 50 TRAVEL AND MANOEUVRE THE DUMPER When travelling and manoeuvring the dumper, it is important to ensure machine stability to reduce the risk of the dumper becoming stuck or tipping over. Learner Workbook FTD v4 June25 Page 29 of 50 Learner Workbook FTD v4 June25 Page 30 of 50 When operating a rotating seat dumper, you can change the seat and console position to allow the operator the best viewpoint while travelling, manoeuvring and operating the machine. The entire operating platform rotates 180 degrees. You may have",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.808736"
  },
  "doc_2_chunk_7": {
    "document_id": "doc_2",
    "chunk_index": 7,
    "content": "29 of 50 Learner Workbook FTD v4 June25 Page 30 of 50 When operating a rotating seat dumper, you can change the seat and console position to allow the operator the best viewpoint while travelling, manoeuvring and operating the machine. The entire operating platform rotates 180 degrees. You may have viewed the pre-operational checks video earlier in this workbook, but please scan the QR code to view again. Learner Workbook FTD v4 June25 Page 31 of 50 Learner Workbook FTD v4 June25 Page 32 of 50 TRAVEL AND MANOEUVRE IN AREAS OF RESTRICTED SPACE Overhead Services It is important that all work near to overhead lines is properly planned and managed to reduce the risk of accidents. The Health and Safety Executive publication ‘Avoiding danger from overhead power lines’ (GS6) gives valuable information and guidance on how to safely plan and set up work near to overhead power lines. High voltage electricity can arc across large gaps in certain conditions. OPERA TING IN CONFINED AREAS Learner Workbook FTD v4 June25 Page 33 of 50 Learner Workbook FTD v4 June25 Page 34 of 50 The Spillard Human Detection System identifies only human form through deep intelligent mapping. It aims to: ✔ Warn operators and pedestrians of potential risks of collision. ✔ Improve operators all around awareness of their surroundings. ✔ Detect human form whilst ignoring ever changing backgrounds. ✔ Reduce risk whilst improving the operator and pedestrian interaction. The human detection system is an aid to safety only. It must be used in addition to the site’s safe system of work. Learner Workbook FTD v4 June25 Page 35 of 50 Safety Shield AI Collision Avoidance Technology Safety Shield is an advanced AI human form recognition safety system. The system cleverly integrates AI human form recognition (HFR) with strategically placed HD cameras. The in-cab LED visual and audio alert warns the driver of a pedestrian in proximity. An additional module can be fitted for an external alarm and Digital Thumbs Up LED display to allow site personal to approach the machine safely and from the correct direction. The Safety Shield system scans and detects all objects around it, but the smart technology will only alert the operator to pedestrians and vulnerable site personnel entering the danger recognition zones. By filtering out objects other than humans, the Safety Shield system reduces unnecessary distractions for the plant operator. Learner Workbook FTD v4 June25 Page 36 of 50 CONDUCT ALL NECESSAR Y SAFETY CHECKS AT THE LOADING AND DISCHARGING AREA Prior to setting up for work, the operator must conduct safety checks at the work area to identify any potential hazards. ENSURE LOAD INTEGRITY/ SECURITY Prior to transporting the load, the following actions must be taken: Learner Workbook FTD v4 June25 Page 37 of 50 • Ensure the load is secured and stable. • Check your travel route. • Arrange assistance for observation and visibility. • Never overload the skip. Overloading obscures the operator’s view and significantly reduces visibility. This increases the hazards associated with",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.809018"
  },
  "doc_2_chunk_8": {
    "document_id": "doc_2",
    "chunk_index": 8,
    "content": "taken: Learner Workbook FTD v4 June25 Page 37 of 50 • Ensure the load is secured and stable. • Check your travel route. • Arrange assistance for observation and visibility. • Never overload the skip. Overloading obscures the operator’s view and significantly reduces visibility. This increases the hazards associated with the people, plant interface. It is the dumper operator responsibility to determine maximum load. Always refer to the manufacturer’s guidelines. LOADING, TRANSPORTING AND DISCHARGING DIFFERENT MATERIALS Denser materials: may overload your tyres and may stick to the body when tipping. You may need to tip at different locations. Semi-Fluid materials: may spill during travel. Spoil: this material should be segregated for re-use on or off-site, where possible. It must be placed a minimum distance of the depth of the trench away from the excavation to prevent collapse. Learner Workbook FTD v4 June25 Page 38 of 50 DISCHARGING LOADS A banksman should be used if deemed necessary in the risk assessment. Cameras are there as a visual aid when approaching the tipping area / stop block. Stop blocks are used to indicate the stopping point of the dumper and to prevent the machine from overrunning into the trench. Learner Workbook FTD v4 June25 Page 39 of 50 Learner Workbook FTD v4 June25 Page 40 of 50 Learner Workbook FTD v4 June25 Page 41 of 50 Learner Workbook FTD v4 June25 Page 42 of 50 ENVIRONMENT AL CONSIDERA TIONS OF MACHINE USE The main types of pollution associated with construction operations are: ● Air pollution ● Water pollution ● Noise pollution There are various pollution prevention strategies that can be used. Operators can minimise their effect on the environment by using the machine efficiently: ● Lower engine speeds where possible. ● Ensure there is no spillage of fluids. ● Keep the machine well maintained. ● Ensure prior planning of the work task. LOADING/ UNLOADING PROCEDURES FOR MACHINE TRANSPORT ATION The transporter driver is responsible for loading operations. The following checks should be made before loading commences: Learner Workbook FTD v4 June25 Page 43 of 50 ✔ Ground support ✔ Ramp condition ✔ Overhead and other hazards ✔ Positioning on trailer ✔ Direction of travel The following process should be followed when loading the transporter: ✔ Remove any dirt or debris from the trailer. ✔ Check parking brake. ✔ Check trailer bodywork for signs of damage. ✔ Position loading ramps securely on the transporter. ✔ Stop the engine and secure the machine. ✔ Chock wheels to prevent movement. ✔ Engage chassis locking bar. ✔ Secure to the trailer. ✔ Ensure legal load (height/weight of trailer) Exclusion zone Always ensure an exclusion zone is in place prior to commencing the loading activity. In areas of no space restrictions, the exclusion zone must: ● Always be clear of personnel. ● Should have a minimum clearance of at least the height of the highest point of the machine. ● Sites with space restrictions will require a risk assessment and driver briefing of the site-specific measures and",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.809274"
  },
  "doc_2_chunk_9": {
    "document_id": "doc_2",
    "chunk_index": 9,
    "content": "of no space restrictions, the exclusion zone must: ● Always be clear of personnel. ● Should have a minimum clearance of at least the height of the highest point of the machine. ● Sites with space restrictions will require a risk assessment and driver briefing of the site-specific measures and procedures (e.g. motorways with restricted space). Learner Workbook FTD v4 June25 Page 44 of 50 Learner Workbook FTD v4 June25 Page 45 of 50 END OF WORK AND SHUT DOWN PROCEDURES When parking the machine at the end of the work period, you must follow the full shut down procedure. Consider where you park your machine. DO NOT park your machine on site roads, pedestrian routes, soft/wet/steep ground, blocking access / egress routes from buildings. Learner Workbook FTD v4 June25 Page 46 of 50 Additional Notes Learner Workbook FTD v4 June25 Page 47 of 50 GLOSSARY OF TERMS TERM DEFINITION Forward Tipping Dumper A construction machine designed to carry and unload loose material by tipping its skip forward over the front wheels. Access To be able to get to a place. Actuating Cause (a machine or device) to operate. Articulated Having two or more sections connected by a flexible joint. Backfilling The process of filling in excavated areas with transported material. Banksman A person who guides the machine operator during movement, especially in confined spaces and when reversing. Beacon A flashing safety light mounted on the ROPS/top of cab to alert others when the machine is in operation. Blind Spots Areas around the dumper not visible to the operator, requiring caution. Boom The main arm attached to a 360’s body that supports the dipper and bucket. Brake Test A routine check to ensure the dumper’s braking system is functioning correctly and safely before operation, typically performed at the start of a shift. Bucket The attachment on a 360 used for digging, grading, trenching or loading duties. Cabbed Dumper Dumper fitted with an enclosed operator cab, providing protection from weather and site conditions. Cab / Operator's Cab The compartment where the operator sits to control the machine, often equipped with joysticks and pedals. Centre of Gravity Balance point of a load. Chassis The main framework of the machine to which all components are mounted. Check Valves Valve monitoring pressure of the system. Collapse The sudden failure of the sides or walls of an excavation, causing soil or materials to cave in. Consequences The effect, result, or outcome of something occurring earlier Contour To change the shape of a surface, making some parts higher and some parts lower Counterbalance A weight that balances another weight. Crush Zone An area where a person could be crushed between moving parts of machinery or between a moving part and a stationary object. Cut and Fill A process involving the removal (cut) and redistribution (fill) of earth to level ground. Deadman The Deadman lever is a safety control mechanism on a machine that must be placed in the isolated (neutral or safe) position to disable machine",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.809540"
  },
  "doc_2_chunk_10": {
    "document_id": "doc_2",
    "chunk_index": 10,
    "content": "a moving part and a stationary object. Cut and Fill A process involving the removal (cut) and redistribution (fill) of earth to level ground. Deadman The Deadman lever is a safety control mechanism on a machine that must be placed in the isolated (neutral or safe) position to disable machine movement before anyone approaches the machine. Differential Lock A feature that locks the drive axles for better traction on slippery or uneven terrain. Discharging The process of unloading material from the skip. Edge Protection A safety system or stop block installed at the edge of elevated work areas to prevent people, materials, or equipment from falling. Egress To be able to leave a place. Exclusion Zone A designated area where access is restricted due to potential hazards, such as heavy machinery, or dangerous operations. Expansion Tank Prevents the system from becoming over-pressurised as the coolant heats up and expands. F.O.P.S. Falling Object Protective Structure - a safety feature built into the cab or canopy of the machine designed to protect the operator from falling objects, such as rocks, debris, or materials from above. Learner Workbook FTD v4 June25 Page 48 of 50 Front Axle Supports the front wheels, often provides steering capability, and transmits drive power depending on the dumper’s drivetrain. GPS Helps ensure precise digging by providing real-time location data, allowing operators to excavate to the correct depth and dimensions without manual measuring. Gradients Slopes. Human Form Recognition (HFR) Technology used to detect the presence of people around the machine. Hydraulics The system of pressurised fluid used to power and control the movement of the machine’s key components. Hydraulic Rams Cylinders that lift the skip to tip and discharge material. Inclines Slopes, gradient. Isolation Procedure Locking out the machine to prevent accidental start-up during maintenance or inspection. Laden Skip The dumper’s skip when it is fully loaded with material ready for transport or unloading. Load Capacity The maximum weight of material the dumper is designed and rated to carry safely in its dump body. Loading Filling the skip with soil, rubble, or other materials, usually by a loader or excavator. Loading Area/Zone The designated area where excavators or loaders load material into the FTD. Load Integrity The condition in which a load remains stable, secure, and contained during transport, ensuring it does not shift, spill, or exceed the limits of the vehicle. Load Limits Maintaining balance when tipping, especially on slopes or uneven ground. Load Security Ensuring that material is safely contained within the body and not overloaded. Hauling Transporting material (e.g., soil, aggregates, spoil) from a loading area to a tipping area. Manoeuvre To move or control the machine. This involves adjusting the machine’s direction, speed, or position for tasks. Material Handling Moving bulk materials, like soil, gravel, or sand, from one place to another. Muck Shifting The process of moving large volumes of earth or spoil from one area of a site to another. Oscillating To move repeatedly from side to side or up and down between",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.809811"
  },
  "doc_2_chunk_11": {
    "document_id": "doc_2",
    "chunk_index": 11,
    "content": "for tasks. Material Handling Moving bulk materials, like soil, gravel, or sand, from one place to another. Muck Shifting The process of moving large volumes of earth or spoil from one area of a site to another. Oscillating To move repeatedly from side to side or up and down between two points. Overloaded The machine carries more weight than its maximum safe payload, risking damage and unsafe operation. People, Plant Interface The interaction between workers (people) and machinery (plant). Pressurised If a container, etc. is pressurised, the air pressure inside it is higher than the air pressure outside it. Rear Axle Located at the back of the vehicle, the rear axle supports the rear wheels, carries part of the load’s weight, and provides drive power to help propel the dumper across the site. Red Zone Area around the machine that is high-risk. Restraining Systems Seat belt. Reversing Alarm A loud alert sound to warn others when the machine is reversing. Risk Assessment The process of identifying hazards in the workplace. R.O.P.S. Rollover Protective Structure – a safety feature in cabs to protect the operator in case of a rollover. Rotating Seat Dumper A type of forward tipping dumper where the operator’s seat and controls can rotate. Safety Critical Actions with the machine can have significant health & safety consequences. Learner Workbook FTD v4 June25 Page 49 of 50 Safety Strut / Prop A strong rod, usually made from metal that helps support raised components (i.e. skip/ booms) Skip/ Bucket The container that holds the load; tips forward to discharge material. Shoring To make a trench stronger by supporting it Slew / Slewing The rotation of the upper structure (cab and boom) of an excavator on its undercarriage. Spoil Waste material such as soil or rubble excavated from the ground and transported by FTD. Spoil Removal Removing excavated material (soil, rocks, etc.) from the site. Straight Skip Dumper type of forward tipping dumper with a fixed, non-rotating skip that tips forward to unload material directly in front of the vehicle. Stockpiling Depositing material in designated piles for later use or removal. Stop Blocks Concrete barriers or blocks used to prevent vehicle access. Sub-base A layer of material placed on top of the ground to provide a stable foundation. Swing Radius The area around an excavator that the upper structure can reach when rotating. Swivel Skip Dumper A forward tipping dumper with a skip that can rotate, allowing the operator to tip material to the side for easier unloading in tight or uneven spaces. Telematics Remote monitoring systems used for tracking machine performance, location, and maintenance needs. Tipping Unloading material by tipping the skip forward over the front wheels. Tipping Area/Zone The area where the dump body is raised to unload material. Tipping Stability The safe practice of tipping only on level, compacted ground to avoid overturning. Towing The act of pulling or hauling another vehicle, trailer, or equipment using the dumper, usually by attaching a tow bar or hitch. Terrain The",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.810093"
  },
  "doc_2_chunk_12": {
    "document_id": "doc_2",
    "chunk_index": 12,
    "content": "area where the dump body is raised to unload material. Tipping Stability The safe practice of tipping only on level, compacted ground to avoid overturning. Towing The act of pulling or hauling another vehicle, trailer, or equipment using the dumper, usually by attaching a tow bar or hitch. Terrain The physical characteristics and surface conditions of the ground, including its slope, texture, hardness, and obstacles, which affect how machinery and workers move and operate. Traction Grip. Traffic Management Plan A site-specific layout that controls plant movement to prevent collisions. Transmission The system that transfers engine power to the wheels. Trenches Narrow, deep excavations made in the ground, typically used for laying pipes, cables, drainage systems, or foundations. Undercarriage Includes the wheels, axles, suspension, frame, and related components that support the machine, provide stability, and enable it to move and carry loads safely across site. Unladen Skip The dumper’s skip when it is empty and not carrying any load. Visibility Aids Mirrors, cameras, or alarms to assist the operator’s awareness of surroundings. Learner Workbook FTD v4 June25 Page 50 of 50",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "learner workbook",
      "description": "",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_Learner Workbook FTD v4 June 2025.pdf",
      "created_at": "2025-09-11T09:33:11.987249+00:00"
    },
    "created_at": "2025-09-11T10:33:13.810224"
  },
  "doc_4_chunk_0": {
    "document_id": "doc_4",
    "chunk_index": 0,
    "content": "Know how to operate a forward tipping dumper Reference : L/600/0547 Level : Level 2 Credit Value : 1 Guided Learning Hours : 7 Aim : The aim of this unit is to provide the learner with the knowledge to operate a forward tipping dumper. The knowledge acquired by the learner will enable them to: • prepare the machine • operate the machine • shut down the machine. Learning Outcomes Assessment Criteria The Learner Will The Learner Can 1 Know how to prepare the machine for work 1.1. - Identify and explain the purpose of principal components, the basic construction, controls and terminology. 1.2. - Describe the manufacturer’s requirements as per the operator’s handbook, other types of information source and relevant regulations and legislation. 1.3. - List and explain all pre-use checks. 1.4. - List and explain all functional and operational checks. 2 Know how to drive and manoeuvre the machine. 2.1. - Understand and explain how to configure and set machine ready for travel (site and highway). 2.2. - Explain how to travel over rough, undulating ground, steep inclines and level surfaces – loaded and unloaded. 2.3. - Describe the actions required to manoeuvre in restricted spaces whilst carrying loads. 3 Know how to set up the machine for work. 3.1 - Describe the procedures to ensure the suitability of the tipping and loading area. 3.2. - Understand and explain actions required for dealing with hazards, underground and overhead services. 4 Know how to undertake the specified work tasks. 4.1. - Describe the actions required for positioning and receiving loads. 4.2. - Describe the processes required to comply with loading procedures. 4.3. - Describe the actions required to ensure load integrity and security. 4.4. - Describe the procedures required to transfer loads to different locations. 4.5. - Describe the procedures required to discharge loads into trenches and over edges. 5 Know how to complete the specified work tasks. 5.1. - Understand and explain actions required to maintain safe and tidy working areas. 6 Know how to shut down the machine. 6.1. - List and explain the shut-down, isolation and securing procedures. 6.2. - List and explain the loading and unloading procedures for machine transporting. Assessment guidance and/or requirements : To be tested in the academic and capability forum. Page 1 of 1",
    "metadata": {
      "course_id": 2,
      "instructor_id": 1,
      "title": "NOCN FTD",
      "description": "know how to operate a forward tipping dumper by NOCN",
      "content_type": "pdf",
      "file_path": "uploads/courses/2_l-600-0547-know-how-to-operate-a-forward-tipping-dumper.pdf",
      "created_at": "2025-09-11T14:45:47.096254+00:00"
    },
    "created_at": "2025-09-11T15:45:47.516774"
  }
}